; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v6)
		(pred_2 ?v4)
		(pred_4 ?v3)
		(pred_5 ?v3)
		(pred_1 ?v4 ?v3)
		(pred_6)
		(pred_3 ?v4))

   (:action op_2
       :parameters  (?v2 ?v8)
       :precondition (and (not-eq ?v2 ?v8) 
                          (pred_4 ?v2) (pred_4 ?v8) (pred_5 ?v2))
       :effect (and  (pred_5 ?v8)
		     (not (pred_5 ?v2))))


   (:action op_1
       :parameters (?v5 ?v1)
       :precondition  (and  (pred_2 ?v5) (pred_4 ?v1)
			    (pred_1 ?v5 ?v1) (pred_5 ?v1) (pred_6))
       :effect (and (pred_3 ?v5)
		    (not (pred_1 ?v5 ?v1)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v5  ?v1)
       :precondition  (and  (pred_2 ?v5) (pred_4 ?v1)
			    (pred_3 ?v5) (pred_5 ?v1))
       :effect (and (pred_1 ?v5 ?v1)
		    (pred_6)
		    (not (pred_3 ?v5)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_03 obj_06 obj_02 obj_01 obj_04 
          obj_07 obj_05 
)
(:init
(pred_4 obj_03)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_4 obj_01)
(pred_4 obj_04)
(pred_2 obj_07)
(pred_2 obj_05)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_6)
(pred_1 obj_07 obj_06)
(pred_1 obj_05 obj_04)
(pred_5 obj_02)
)
(:goal
(and
(pred_1 obj_07 obj_06)
(pred_1 obj_05 obj_03)
)
)

(:constraints
  (sometime-before  (pred_1 obj_05 obj_03) (pred_5 obj_06))
)
)

; plan
1. (op_2 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_06)
   goals met: 1 of 2
2. (op_1 obj_07 obj_06)
   deleted: (pred_1 obj_07 obj_06) (pred_6)
   added: (pred_3 obj_07)
   goals met: 0 of 2
3. (op_2 obj_06 obj_04)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_04)
   goals met: 0 of 2
4. (op_3 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_1 obj_07 obj_04) (pred_6)
   goals met: 0 of 2
5. (op_1 obj_05 obj_04)
   deleted: (pred_1 obj_05 obj_04) (pred_6)
   added: (pred_3 obj_05)
   goals met: 0 of 2
6. (op_2 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 0 of 2
7. (op_3 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_1 obj_05 obj_03) (pred_6)
   goals met: 1 of 2
8. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 1 of 2
9. (op_1 obj_07 obj_04)
   deleted: (pred_1 obj_07 obj_04) (pred_6)
   added: (pred_3 obj_07)
   goals met: 1 of 2
10. (op_2 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_06)
   goals met: 1 of 2
11. (op_3 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_1 obj_07 obj_06) (pred_6)
   goals met: 2 of 2
